"""
Коллекции Итерируемые объекты

list - Списки - Литерал []
tuple - Кортежи - Литерал ()
str - Строки - Неизменяемый тип данных литерал "" '' ''''''


dict - Словари литерал {}

set - Множества {}
frozenset - Замороженное множество

"""

name = "Василий"
surname = "Иванов"
age = 33
height = 182

# вычислить Год рождения (относительно текущего года) и присвоить переменной birth_year
# Составить строку по шаблону {name} {surname} {birth_year} ростом {height} см и присвоить переменной bio
# Напечатать на экране значение bio


birth_year = 2021 - age


a = [1, 2]

