"""
Для игры TTT

реализовать сохранение лога игры. 

в логе должно присутсвовать: 
- Когда начата игра
- Номер игры в данной сессии игры
- В каком режиме начата игра
- Каждый ход игрока
- Кто победил и на каком шаге
- Выбран ли реванш
В случаях реванша, мы начинаем новую игру, сессия игры продолжается
(Сессия игры это фактический запуск игры, пока пользователь выбирает реванш сессия продолжается, но начинается новая 
игра)

Для логирования данных записей, вам необходимо, разработать удобный способ хранения данных игры в файле. Можно 
воспользоваться схемой CSV
Использовать сторонние модули по типу JSON или CSV  неможно. пишим в файл ручками

"""
