"""
1. Задание
дана переменная
"""
dog = "Шарик"
action = "Играет"
toy = "Мячик"

# напечатать на экране фразу по шаблону {dog} {action} в {toy}


"""
2. Задание
Даны данные человека
"""

name = "Василий"
surname = "Иванов"
age = 33
height = 182

# вычислить Год рождения (относительно текущего года) и присвоить переменной birth_year
# Составить строку по шаблону {name} {surname} {birth_year} ростом {182} см и присвоить переменной bio
# Напечатать на экране значение bio

# ВНИМАНИЕ !
"""
- Каждое задание выполнять в отдельном .py файле
- Создать у себя виртуальное окружение и проверить работоспособность указанного задания
- Закомитить решения в Github
"""

